EE990/HW_eeromWriter/EEPROM/library/HT32F520xx_Driver/src/ht32f520xx_i2c.c
/*********************************************************************************************************//**
  * @brief  Send a data word through the I2Cx peripheral.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @param  I2C_Data: Byte to be transmitted.
  * @retval None
  ***********************************************************************************************************/
void I2C_SendData(HT_I2C_TypeDef* I2Cx, u8 I2C_Data)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));

  I2Cx->DR = I2C_Data;
}

/*********************************************************************************************************//**
  * @brief  Return the received data by the I2Cx peripheral.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @retval The value of the received data.
  ***********************************************************************************************************/
u8 I2C_ReceiveData(HT_I2C_TypeDef* I2Cx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));

  return (u8)I2Cx->DR;
}

/*********************************************************************************************************//**
  * @brief  Read the specified I2C register and returns its value.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @param  I2C_Register: specify the register to read.
  *   This parameter can be one of the following values:
  *     @arg I2C_REGISTER_CR              : Control Register
  *     @arg I2C_REGISTER_IER             : Interrupt Enable Register
  *     @arg I2C_REGISTER_ADDR            : Address Register
  *     @arg I2C_REGISTER_SR              : Status Register
  *     @arg I2C_REGISTER_SHPGR           : SCL High Period Generation Register
  *     @arg I2C_REGISTER_SLPGR           : SCL Low Period Generation Register
  *     @arg I2C_REGISTER_DR              : Data Register
  *     @arg I2C_REGISTER_TAR             : Target Register
  * @retval None
  ***********************************************************************************************************/
u32 I2C_ReadRegister(HT_I2C_TypeDef* I2Cx, u8 I2C_Register)
{
  vu32 tmp = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_REGISTER(I2C_Register));

  tmp = (u32)I2Cx;
  tmp += I2C_Register;
  return (*(u32 *)tmp);
}

/*********************************************************************************************************//**
  * @brief  Check whether the specified I2C flag has been set.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @param  I2C_Flag: specify the flag to be check.
  *   This parameter can be one of the following values:
  *     @arg I2C_FLAG_STA                 : I2C start condition transmitted flag (Master mode)
  *     @arg I2C_FLAG_STO                 : I2C stop condition detected flag (Slave flag)
  *     @arg I2C_FLAG_ADRS                : I2C address flag
  *     @arg I2C_FLAG_GCS                 : I2C general call flag (Slave mode)
  *     @arg I2C_FLAG_ARBLOS              : I2C arbitration loss flag (Master mode)
  *     @arg I2C_FLAG_RXNACK              : I2C received not acknowledge flag
  *     @arg I2C_FLAG_BUSERR              : I2C bus error flag
  *     @arg I2C_FLAG_RXDNE               : I2C Rx data not empty flag
  *     @arg I2C_FLAG_TXDE                : I2C Tx data empty flag
  *     @arg I2C_FLAG_RXBF                : I2C RX buffer full flag
  *     @arg I2C_FLAG_BUSBUSY             : I2C bus busy flag
  *     @arg I2C_FLAG_MASTER              : I2C master mode flag (Master flag)
  *     @arg I2C_FLAG_TXNRX               : I2C transmitter mode flag
  * @retval SET or RESET
  ***********************************************************************************************************/
FlagStatus I2C_GetFlagStatus(HT_I2C_TypeDef* I2Cx, u32 I2C_Flag)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_FLAG(I2C_Flag));

  if ((I2Cx->SR & I2C_Flag) != (u32)RESET)
  {
    return (SET);
  }
  else
  {
    return (RESET);
  }
}

/*********************************************************************************************************//**
  * @brief  Check whether the specified I2C status has been active.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @param  I2C_Status: specify the flag that is to be check.
  *   This parameter can be one of the following values:
  *     @arg I2C_MASTER_SEND_START
  *     @arg I2C_MASTER_RECEIVER_MODE
  *     @arg I2C_MASTER_TRANSMITTER_MODE
  *     @arg I2C_MASTER_RX_NOT_EMPTY
  *     @arg I2C_MASTER_RX_NOT_EMPTY_NOBUSY
  *     @arg I2C_MASTER_TX_EMPTY
  *     @arg I2C_MASTER_RX_BUFFER_FULL
  *     @arg I2C_SLAVE_ACK_TRANSMITTER_ADDRESS
  *     @arg I2C_SLAVE_ACK_RECEIVER_ADDRESS
  *     @arg I2C_SLAVE_ACK_GCALL_ADDRESS
  *     @arg I2C_SLAVE_RX_NOT_EMPTY
  *     @arg I2C_SLAVE_RX_NOT_EMPTY_STOP
  *     @arg I2C_SLAVE_TX_EMPTY
  *     @arg I2C_SLAVE_RX_BUFFER_FULL
  *     @arg I2C_SLAVE_RECEIVED_NACK
  *     @arg I2C_SLAVE_RECEIVED_NACK_STOP
  *     @arg I2C_SLAVE_STOP_DETECTED
  * @retval SUCCESS or ERROR
  ***********************************************************************************************************/
ErrStatus I2C_CheckStatus(HT_I2C_TypeDef* I2Cx, u32 I2C_Status)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_STATUS(I2C_Status));

  if (I2Cx->SR == I2C_Status)
  {
    return (SUCCESS);
  }
  else
  {
    return (ERROR);
  }
}

