EE990/HW_eeromWriter/EEPROM/library/HT32F520xx_Driver/src/ht32f520xx_i2c.c
/*********************************************************************************************************//**
  * @brief  This function is used to set the prescaler of I2C timeout value.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @param  I2C_Prescaler: specify the I2C time out prescaler value.
  *   This parameter can be one of the following values:
  *     @arg I2C_PRESCALER_1   : I2C prescaler set to 1
  *     @arg I2C_PRESCALER_2   : I2C prescaler set to 2
  *     @arg I2C_PRESCALER_4   : I2C prescaler set to 4
  *     @arg I2C_PRESCALER_16  : I2C prescaler set to 16
  *     @arg I2C_PRESCALER_32  : I2C prescaler set to 32
  *     @arg I2C_PRESCALER_64  : I2C prescaler set to 64
  *     @arg I2C_PRESCALER_128 : I2C prescaler set to 128
  * @retval None
  ***********************************************************************************************************/
void I2C_SetTimeOutPrescaler(HT_I2C_TypeDef* I2Cx, u32 I2C_Prescaler)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_PRESCALER(I2C_Prescaler));

  I2Cx->TOUT = (I2C_Prescaler | (I2Cx->TOUT & 0x0000FFFF));
}

/*********************************************************************************************************//**
  * @brief  This function is used to determine the prescaler of I2C timeout value.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @param  I2C_Mask: specify the bit position of I2C slave address to be masked.
  *   This parameter can be any combination of the following values:
  *     @arg I2C_MASKBIT_0     : Bit 0 of I2C slave address is masked
  *     @arg I2C_MASKBIT_1     : Bit 1 of I2C slave address is masked
  *     @arg I2C_MASKBIT_2     : Bit 2 of I2C slave address is masked
  *     @arg I2C_MASKBIT_3     : Bit 3 of I2C slave address is masked
  *     @arg I2C_MASKBIT_4     : Bit 4 of I2C slave address is masked
  *     @arg I2C_MASKBIT_5     : Bit 5 of I2C slave address is masked
  *     @arg I2C_MASKBIT_6     : Bit 6 of I2C slave address is masked
  *     @arg I2C_MASKBIT_7     : Bit 7 of I2C slave address is masked
  *     @arg I2C_MASKBIT_8     : Bit 8 of I2C slave address is masked
  *     @arg I2C_MASKBIT_9     : Bit 9 of I2C slave address is masked
  * @retval None
  ***********************************************************************************************************/
void I2C_AddressMaskConfig(HT_I2C_TypeDef* I2Cx, u32 I2C_Mask)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_ADDRESS_MASK(I2C_Mask));

  I2Cx->ADDMR = I2C_Mask;
}

/*********************************************************************************************************//**
  * @brief  Return the received address by the I2Cx peripheral.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @retval The value of the received address.
  ***********************************************************************************************************/
u16 I2C_GetAddressBuffer(HT_I2C_TypeDef* I2Cx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));

  return ((u16)I2Cx->ADDBR);
}

/*********************************************************************************************************//**
  * @brief  Enable or Disable the combinational filter.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @param  NewState: This parameter can be ENABLE or DISABLE.
  * @retval None
  ***********************************************************************************************************/
void I2C_CombFilterCmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_COMBFILTER_SET;
  }
  else
  {
    I2Cx->CR &= CR_COMBFILTER_RESET;
  }
}

/*********************************************************************************************************//**
  * @brief  This function is used to determine the filter glitch width of 0~2 PCLK.
  * @param  I2Cx: where I2Cx is the selected I2C peripheral, x can be 0 or 1.
  * @param  Seq_Filter_Select: specify the glitch width of 0~2 PCLK.
  *   This parameter can be any combination of the following values:
  *     @arg SEQ_FILTER_DISABLE: sequential filter is disabled
  *     @arg SEQ_FILTER_1_PCLK : filter glitch width of 1 PCLK
  *     @arg SEQ_FILTER_2_PCLK : filter glitch width of 2 PCLK
* @retval None
  ***********************************************************************************************************/
void I2C_SequentialFilterConfig(HT_I2C_TypeDef* I2Cx, u32 Seq_Filter_Select)
{
  u32 SHPGR = I2Cx->SHPGR;
  u32 SLPGR = I2Cx->SLPGR;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_SEQ_FILTER_MASK(Seq_Filter_Select));

  switch (I2Cx->CR & 0xC000)
  {
    case 0:
      if (Seq_Filter_Select == SEQ_FILTER_1_PCLK)
      {
        if (SHPGR >= 2)
        {
          SHPGR -= 2;
          SLPGR -= 2;
        }
      }
      else if (Seq_Filter_Select == SEQ_FILTER_2_PCLK)
      {
        if (SHPGR >= 2)
        {
          SHPGR -= 3;
          SLPGR -= 3;
        }
      }
      break;

    case 0x4000:
      if (Seq_Filter_Select == SEQ_FILTER_DISABLE)
      {
        SHPGR += 2;
        SLPGR += 2;
      }
      else if (Seq_Filter_Select == SEQ_FILTER_2_PCLK)
      {
        if (SHPGR >= 1)
        {
          SHPGR -= 1;
          SLPGR -= 1;
        }
      }
      break;

    case 0x8000:
      if (Seq_Filter_Select == SEQ_FILTER_DISABLE)
      {
        SHPGR += 3;
        SLPGR += 3;
      }
      else if (Seq_Filter_Select == SEQ_FILTER_1_PCLK)
      {
        SHPGR += 1;
        SLPGR += 1;
      }
      break;

    default:
      break;
  }

  I2Cx->SHPGR = SHPGR;
  I2Cx->SLPGR = SLPGR;
  I2Cx->CR = (I2Cx->CR & 0x3FFF) | Seq_Filter_Select;
}
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
